Clef-Y/killerbee/firmware/src/kb-cc1354p10/kb_cc1354p10.syscfg
/*
 * kb_cc1354p10.syscfg
 *
 * SysConfig script for the KillerBee CC1354P10 sniffer/injector/jammer
 * firmware. Configures:
 *   - RF driver on the native 2.4 GHz IEEE 802.15.4 PHY (channels 11-26)
 *   - UART2 on the standalone LP-XDS110 probe's backchannel (the same
 *     /dev/ttyACM* serial port already used to talk to the debug probe)
 *
 * Deliberately does NOT pull in the ti154stack MAC module - this firmware
 * drives the RF core directly with raw CMD_IEEE_RX / CMD_IEEE_TX / CMD_TX_TEST
 * radio commands so KillerBee gets full promiscuous / injection / jamming
 * control instead of a MAC-filtered view of the air.
 */
// @cliArgs --board /ti/boards/LP_EM_CC1354P10_1 --rtos tirtos7

/* ======== RF ======== */
var RF = scripting.addModule("/ti/drivers/RF");
if (system.deviceData.board && system.deviceData.board.components.RF) {
    RF.$hardware = system.deviceData.board.components.RF;
}

/* ======== UART2 (XDS110 backchannel) ======== */
var UART2 = scripting.addModule("/ti/drivers/UART2");
var uart = UART2.addInstance();
if (system.deviceData.board && system.deviceData.board.components.XDS110UART) {
    uart.$hardware = system.deviceData.board.components.XDS110UART;
}
uart.$name = "CONFIG_UART2_KB";

/* ======== Status LEDs ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");
var LED_R = GPIO.addInstance();
if (system.deviceData.board && system.deviceData.board.components.LED_RED) {
    LED_R.$hardware = system.deviceData.board.components.LED_RED;
} else {
    LED_R.mode = "Output";
}
LED_R.$name = "CONFIG_GPIO_RLED";

var LED_G = GPIO.addInstance();
if (system.deviceData.board && system.deviceData.board.components.LED_GREEN) {
    LED_G.$hardware = system.deviceData.board.components.LED_GREEN;
} else {
    LED_G.mode = "Output";
}
LED_G.$name = "CONFIG_GPIO_GLED";

/* ======== Radio Configuration: native 2.4 GHz IEEE 802.15.4 PHY ======== */
const commonRf = system.getScript("/ti/prop_rf/prop_rf_common.js");
const boardName = commonRf.getDeviceOrLaunchPadName(true);
const phyFilePath = "/ti/prop_rf/rf_config/" + boardName + "_rf_defaults.js";

// Pull the board's default IEEE 802.15.4 (2.4 GHz) phy definition
const default154Phy = system.getScript(phyFilePath).default154PhyList[0];

// Add an instance of the "Custom" RF Stack and attach the ieee154 phy to it
const customStack = scripting.addModule("/ti/devices/radioconfig/custom");
const phyInst = commonRf.addIeeePhy(customStack, default154Phy);
phyInst.$name = "RF_Settings_IEEE_802_15_4";
phyInst.codeExportConfig.useMulti = false;

/* ======== Radio Configuration: 915 MHz SUN O-QPSK (sub-1GHz) PHY ========
 * Modern IEEE 802.15.4g "SUN" O-QPSK equivalent of the classic 915 MHz
 * Zigbee band (KillerBee page 31 / FREQ_915), Rate Mode 0 (6.25 kbps,
 * 100 kchip/s) - the mandatory/base rate mode per 802.15.4g, chosen for
 * broadest interoperability. TI's own preset label marks this "Release
 * Candidate" (see cc1354p10_prop_pg20/param_syscfg.json), i.e. not a
 * TI-validated production PHY - treat accordingly.
 *
 * Runtime-switched with the 2.4 GHz PHY above via RF_close()+RF_open() in
 * main.c (see its rfSwitchBand() comment for the tradeoffs of that
 * approach on this hardware).
 *
 * txPower explicitly set to a conservative 0 dBm (default is 14, capped to
 * this table's max of 12) and highPA left at its default false (the
 * +20 dBm high-PA table is never used here). This is a real mitigation,
 * not a guess: a hardware-confirmed brown-out reset (AON_PMCTL.RESETCTL
 * RESET_SRC=VDDS_LOSS, read directly off the chip during a reproduced
 * hang - see README's "Sub-1GHz support" section) was found to correlate
 * with sub-1GHz TX key-up, most likely from the PA's current step
 * exceeding what this board's power delivery (LP_EM_CC1354P10_1 through
 * the LP-XDS110's jumper/ribbon power path) can sustain without the
 * supply rail dipping below the brown-out threshold - even at the
 * already-modest default 12-14 dBm this PHY preset was using. Lowering
 * further reduces that current step. This does not fix the underlying
 * power-delivery issue (a clean bench supply is the real fix) and has not
 * yet been empirically confirmed to eliminate the brown-out - it's a
 * reasonable firmware-side mitigation, not a proven cure. */
const subgPhy = {
    args: {
        freqBand: "868",
        phyType868: "qpsk6kbpsrm0",
        txPower: "0"
    }
};
const subgPhyInst = commonRf.addPropPhy(customStack, subgPhy, false);
subgPhyInst.$name = "RF_Settings_SUBG_OQPSK";
subgPhyInst.codeExportConfig.useMulti = false;

/* ======== RF Design ======== */
var rfDesign = scripting.addModule("ti/devices/radioconfig/rfdesign");
const rfDesignSettings = system.getScript("/ti/common/lprf_rf_design_settings.js").rfDesignSettings;
for (var setting in rfDesignSettings) {
    rfDesign[setting] = rfDesignSettings[setting];
}

/* ======== Device / CCFG ======== */
var device = scripting.addModule("ti/devices/CCFG");
const ccfgSettings = system.getScript("/ti/common/lprf_ccfg_settings.js").ccfgSettings;
for (var setting in ccfgSettings) {
    device[setting] = ccfgSettings[setting];
}

/* ======== TI-RTOS7 kernel defaults ======== */
const tirtos7_release_syscfg_js = system.getScript("tirtos7_release.syscfg.js");
